Tekla Open API Reference for Tekla Structures 2025
Drawing.OutputDate Property
 The drawing output date. XS_DISABLE_DRAWING_PLOT_DATE controls whether this date is set.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DateTime OutputDate { get; }
Public ReadOnly Property OutputDate As DateTime
	Get
Property Value
Type: DateTime
See Also
Reference
Drawing Class
Tekla.Structures.Drawing Namespace